# Большинство строк текста, используемого ботом,
# Возможно их изменение, без потери работоспособности текстовых команд
strings = {
    "start": "📡 Чтобы узнать погоду нажмите на кнопку снизу.\nПомощь - /help",

    "subscribe": "🌍 Введите название города для рассылки...\n/cancel - отмена",

    "cancel": "Действие отменено!",

    "success": "✅ Вы успешно зарегистрировались на рассылку.",

    "not_found": "❌ Ой, такой город не был найден!\nПопробуйте снова...\n/cancel - отмена.",

    "not_active": "❌ У вас нет активной рассылки.\n/subscribe - подписаться.",

    "unsubscribe": "✅ Вы успешно отписались от рассылки.",

    "help": "Это бот, созданный для получения актуальной погоды в любом городе. "
            "Чтобы узнать погоду, Вам нужно нажать на кнопку снизу слева "
            "(если её нет, то нажмите на значок квадратика с четырмя квадратиками внутри). "
            "Также существует рассылка, вот список её команд:\n\n"
            "/subscribe - Подписка на рассылку. "
            "В 8:00 и 14:00 погода на сегодня, а в 20:00 на завтра (время по МСК).\n"
            "/unsubscribe - Отписаться от рассылки.\n\n"
            "Если Вам что-то непонятно, остались вопросы или Вы нашли баг, "
            "то напишите об этом разработчику, через команду - /help_me",

    "help_me": "Введите ваш вопрос / пожелание, буду отвечать настолько, насколько это возможно.\n"
               "Если вы передумали задавать вопрос, то отправьте - /cancel .",

    "not_ask": "Вы не стали задавать вопрос.",

    "understand": "💬 Прости, я не понимаю тебя...\nПомощь - /help",

    "not_cmd": "❓ Неизвестная команда!\nПомощь - /help",

    "mail_send": "📬 Команды рассылки:\n/subscribe - Подписаться на рассылку.\n/unsubscribe - Отписаться от рассылки.\n",

    "weather": "🌍 Чтобы узнать погоду, введите название города.\nНапример: Москва",

    "now": "🌤 Текущая погода.",

    "daily": "🌧 Погода на завтра.",

    "mail": "✏ Рассылка погоды.",

}
